laravel/app/Http/Controllers/AtacController.php

select * from `preguntas` order by RAND() limit 1
insert into `atacs` (`name`, `idUser`, `idPregunta`, `estat`, `updated_at`, `created_at`) values ('Castella i Lleo', 'fs', 23, 'P_ENVIADA', '2024-04-15 18:10:33', '2024-04-15 18:10:33')
---
    public function enviarAtac(Request $request){

        $name = $request->input('name');
        $idUser = $request->input('idUser');


        $pregunta = Pregunta::inRandomOrder()->first();

       $estat="P_ENVIADA";

        $atac = new Atac();
        $atac->name = $name;
        $atac->idUser = $idUser;
        $atac->idPregunta = $pregunta->id;
        $atac->estat = $estat;
        $atac->save();