laravel/app/Http/Controllers/PaisController.php

    public function borrarOcupantes()
    {

            DB::table('pais')->update(['ocupante' => null]);
---
update `pais` set `ocupante` = ''

    public function confirmarAtaque(Request $request){
        $idPais = $request->paisSeleccionado;
        $pais = Pais::find($idPais);

        if (!$pais) {
            return response()->json(['error' => 'País no encontrado'], 404);
        }

        $idUser = $request->idUser;
        $pais->ocupante = $idUser;
        $pais->save();
---
select * from `pais` where `pais`.`id` = 'ES-CL' limit 1
update `pais` set `ocupante` = 'fs', `pais`.`updated_at` = '2024-04-15 18:10:43' where `id` = 'ES-CL'

    public function propietariosPaises(Request $request) {
        $arrayUsers = $request->input('arrayUsers');

        if (!is_array($arrayUsers)) {
            throw new \Exception('El parámetro "arrayUsers" no es un array válido.');
        }

        Log::info('Array de usuarios: ' . json_encode($arrayUsers));
        // Obtén un array plano de los usuarios
        $usuarios = array_column($arrayUsers, 'nombreUsuario');

        Log::info('Usuarios: ' . json_encode($usuarios));
        $paisesConquistados = Pais::whereIn('ocupante', $arrayUsers)->get();

        $cantidadPaisesPorUsuario = [];
        $todosConquistados = 15;
        foreach ($arrayUsers as $usuario) {
            if (is_array($usuario)) {
                $nombreUsuario = $usuario['nombreUsuario'];
            } else {
                $nombreUsuario = $usuario;
            }
            $cantidadPaises = $paisesConquistados->where('ocupante', $nombreUsuario)->count();
---
select * from `pais` where `ocupante` in ('fs', 'fs')
select count(*) as aggregate from `pais` where `ocupante` is not null

    public function todosPaisesConquistados() {

        $totalPaises = Pais::count();
---
select count(*) as aggregate from `pais`