laravel/app/Http/Controllers/PreguntaController.php

select * from `preguntas` where `preguntas`.`id` = 2 limit 1
---
    public function eliminarPregunta(Request $request){
        // Encuentra la pregunta en la base de datos
        $pregunta = Pregunta::find($request->id);